/*
面试题 08.11. 硬币
硬币。给定数量不限的硬币，币值为25分、10分、5分和1分，编写代码计算n分有几种表示法。(结果可能会很大，你需要将结果模上1000000007)
示例1:
 输入: n = 5
 输出：2
 解释: 有两种方式可以凑成总金额:
5=5
5=1+1+1+1+1
示例2:
 输入: n = 10
 输出：4
 解释: 有四种方式可以凑成总金额:
10=10
10=5+5
10=5+1+1+1+1+1
10=1+1+1+1+1+1+1+1+1+1
说明：
注意:
你可以假设：
0 <= n (总金额) <= 1000000
*/

//外层先循环硬币， 如果先循环n会出现重复的计算的情况
#define num 1000000007
int waysToChange(int n){
    int* dp = (int*)malloc(sizeof(int) * (n + 1));
    memset(dp, 0, sizeof(int) * (n + 1));

    dp[0] = 1;
    int coin[4] = {1, 5, 10, 25};
    for(int i = 0; i < 4; ++i)
    {
        for(int j = 1; j <= n; ++j)
        {
            if(j - coin[i] >= 0)
            {
                dp[j] = (dp[j] + dp[j - coin[i]]) % num; 
            }
        }
    }

    return dp[n];
}